[
  {
    "myanimelist_id": 2,
    "aired_on": "Aug 1989 -",
    "myanimelist_url": "https://myanimelist.net/manga/2/Berserk",
    "title": "Berserk",
    "rank": 1,
    "picture_url": "https://i.imgur.com/F7EbohS.jpg",
    "score": 9.47,
    "members": 633345,
    "type": "Manga (? vols)",

    "authors": [
      {
        "url": "https://myanimelist.net/people/1868/Kentarou_Miura",
        "name": "Kentarou Miura"
      }
    ],
    "synopsis": "Guts, a former mercenary now known as the \"Black Swordsman,\" is out for revenge. After a tumultuous childhood, he finally finds someone he respects and believes he can trust, only to have everything fall apart when this person takes away everything important to Guts for the purpose of fulfilling his own desires. Now marked for death, Guts becomes condemned to a fate in which he is relentlessly pursued by demonic beings.\n\r\nSetting out on a dreadful quest riddled with misfortune, Guts, armed with a massive sword and monstrous strength, will let nothing stop him, not even death itself, until he is finally able to take the head of the one who stripped him—and his loved one—of their humanity.\n\r\n[Written by MAL Rewrite]\n\nIncluded one-shot:\r\nVolume 14: Berserk: The Prototype",
    "firstTenPages":[ "https://i.imgur.com/F7EbohS.jpg","https://i.imgur.com/Ftnms4b.jpg","https://i.imgur.com/CKObQ2p.jpg","https://i.imgur.com/Z3MNsJO.jpg","https://i.imgur.com/BZzJB6j.jpg","https://i.imgur.com/wM70nxV.jpg","https://i.imgur.com/eKkOPg1.jpg","https://i.imgur.com/s8Zeg9K.jpg","https://i.imgur.com/6UxGp0t.jpg","https://i.imgur.com/clLs4uF.jpg"]
  },
  {
    "myanimelist_id": 23390,
    "aired_on": "Sep 2009 - Apr 2021",
    "myanimelist_url": "https://myanimelist.net/manga/23390/Shingeki_no_Kyojin",
    "title": "Attack on Titan",
    "rank": 2,
    "picture_url": "https://i.imgur.com/qNn3Dj3.jpg",
    "score": 8.56,
    "members": 630751,
    "type": "Manga (34 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/11705/Hajime_Isayama",
        "name": "Hajime Isayama"
      }
    ],
    "synopsis": "Hundreds of years ago, horrifying creatures which resembled humans appeared. These mindless, towering giants, called \"Titans,\" proved to be an existential threat, as they preyed on whatever humans they could find in order to satisfy a seemingly unending appetite. Unable to effectively combat the Titans, mankind was forced to barricade themselves within large walls surrounding what may very well be humanity's last safe haven in the world.\n\r\nIn the present day, life within the walls has finally found peace, since the residents have not dealt with Titans for many years. Eren Yeager, Mikasa Ackerman, and Armin Arlert are three young children who dream of experiencing all that the world has to offer, having grown up hearing stories of the wonders beyond the walls. But when the state of tranquility is suddenly shattered by the attack of a massive 60-meter Titan, they quickly learn just how cruel the world can be. On that day, Eren makes a promise to himself that he will do whatever it takes to eradicate every single Titan off the face of the Earth, with the hope that one day, humanity will once again be able to live outside the walls without fear.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/bTM4Tmy.jpg","https://i.imgur.com/AaQe1XL.jpg","https://i.imgur.com/2rFLAe8.jpg","https://i.imgur.com/aTFLjq6.jpg","https://i.imgur.com/DyGGefb.jpg","https://i.imgur.com/uXBgOVV.jpg","https://i.imgur.com/Mt9t9km.jpg","https://i.imgur.com/jLZQ5VX.jpg","https://i.imgur.com/iRJNcRY.jpg","https://i.imgur.com/Vf3THLU.jpg"]
  },
  {
    "myanimelist_id": 13,
    "aired_on": "Jul 1997 -",
    "myanimelist_url": "https://myanimelist.net/manga/13/One_Piece",
    "title": "One Piece",
    "rank": 3,
    "picture_url": "https://i.imgur.com/w0DqCJl.jpg",
    "score": 9.21,
    "members": 569973,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1881/Eiichiro_Oda",
        "name": "Eiichiro Oda"
      }
    ],
    "synopsis": "Gol D. Roger, a man referred to as the \"King of the Pirates,\" is set to be executed by the World Government. But just before his demise, he confirms the existence of a great treasure, One Piece, located somewhere within the vast ocean known as the Grand Line. Announcing that One Piece can be claimed by anyone worthy enough to reach it, the King of the Pirates is executed and the Great Age of Pirates begins.\n\r\nTwenty-two years later, a young man by the name of Monkey D. Luffy is ready to embark on his own adventure, searching for One Piece and striving to become the new King of the Pirates. Armed with just a straw hat, a small boat, and an elastic body, he sets out on a fantastic journey to gather his own crew and a worthy ship that will take them across the Grand Line to claim the greatest status on the high seas.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/o2Ve8dW.jpg","https://i.imgur.com/ywsR38Q.jpg","https://i.imgur.com/MtgE1vP.jpg","https://i.imgur.com/etUJjCu.jpg","https://i.imgur.com/7OJunda.jpg","https://i.imgur.com/LUnE910.jpg","https://i.imgur.com/VJhkGij.jpg","https://i.imgur.com/y3m2EVz.jpg","https://i.imgur.com/RAQc786.jpg","https://i.imgur.com/JSWj5Wx.jpg"]
  },
  {
    "myanimelist_id": 116778,
    "aired_on": "Dec 2018 -",
    "myanimelist_url": "https://myanimelist.net/manga/116778/Chainsaw_Man",
    "title": "Chainsaw Man",
    "rank": 4,
    "picture_url": "https://i.imgur.com/S7nJf8n.jpg",
    "score": 8.75,
    "members": 558019,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/41158/Tatsuki_Fujimoto",
        "name": "Tatsuki Fujimoto"
      }
    ],
    "synopsis": "Denji has a simple dream—to live a happy and peaceful life, spending time with a girl he likes. This is a far cry from reality, however, as Denji is forced by the yakuza into killing devils in order to pay off his crushing debts. Using his pet devil Pochita as a weapon, he is ready to do anything for a bit of cash.\n\r\nUnfortunately, he has outlived his usefulness and is murdered by a devil in contract with the yakuza. However, in an unexpected turn of events, Pochita merges with Denji's dead body and grants him the powers of a chainsaw devil. Now able to transform parts of his body into chainsaws, a revived Denji uses his new abilities to quickly and brutally dispatch his enemies. Catching the eye of the official devil hunters who arrive at the scene, he is offered work at the Public Safety Bureau as one of them. Now with the means to face even the toughest of enemies, Denji will stop at nothing to achieve his simple teenage dreams.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/kKutbdI.jpg","https://i.imgur.com/NuqFqwg.jpg","https://i.imgur.com/as9PuEz.jpg","https://i.imgur.com/CyvEFsE.jpg","https://i.imgur.com/GSdB9He.jpg","https://i.imgur.com/l0j5XCA.jpg","https://i.imgur.com/CbPsgqr.jpg","https://i.imgur.com/yhGWufL.jpg","https://i.imgur.com/UNepRI8.jpg","https://i.imgur.com/J1yE3XJ.jpg"]
  },
  {
    "myanimelist_id": 33327,
    "aired_on": "Sep 2011 - Sep 2014",
    "myanimelist_url": "https://myanimelist.net/manga/33327/Tokyo_Ghoul",
    "title": "Tokyo Ghoul",
    "rank": 5,
    "picture_url": "https://i.imgur.com/MgDrE7O.jpg",
    "score": 8.52,
    "members": 475250,
    "type": "Manga (14 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/15753/Sui_Ishida",
        "name": "Sui Ishida"
      }
    ],
    "synopsis": "Lurking within the shadows of Tokyo are frightening beings known as \"ghouls,\" who satisfy their hunger by feeding on humans once night falls. An organization known as the Commission of Counter Ghoul (CCG) has been established in response to the constant attacks on citizens and as a means of purging these creatures. However, the problem lies in identifying ghouls as they disguise themselves as humans, living amongst the masses so that hunting prey will be easier. Ken Kaneki, an unsuspecting university freshman, finds himself caught in a world between humans and ghouls when his date turns out to be a ghoul after his flesh.\n\r\nBarely surviving this encounter after being taken to a hospital, he discovers that he has turned into a half-ghoul as a result of the surgery he received. Unable to satisfy his intense craving for human meat through conventional means, Kaneki is taken in by friendly ghouls who run a coffee shop in order to help him with his transition. As he begins what he thinks will be a peaceful new life, little does he know that he is about to find himself at the center of a war between his new comrades and the forces of the CCG, and that his new existence has caught the attention of ghouls all over Tokyo.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/MevorVm.jpg","https://i.imgur.com/71kacmR.jpg","https://i.imgur.com/fsECr3d.jpg","https://i.imgur.com/mNqrLLr.jpg","https://i.imgur.com/XG6nRvq.jpg","https://i.imgur.com/dGbN2hu.jpg","https://i.imgur.com/K4ncbpa.jpg","https://i.imgur.com/4sZhwOD.jpg","https://i.imgur.com/JiXeP2i.jpg","https://i.imgur.com/8cIlM34.jpg"]
  },
  {
    "myanimelist_id": 44347,
    "aired_on": "Jun 2012 -",
    "myanimelist_url": "https://myanimelist.net/manga/44347/One_Punch-Man",
    "title": "One Punch-Man",
    "rank": 6,
    "picture_url": "https://i.imgur.com/SMZR8vZ.jpg",
    "score": 8.75,
    "members": 451968,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1903/Yusuke_Murata",
        "name": "Yusuke Murata"
      },
      {
        "url": "https://myanimelist.net/people/16993/ONE",
        "name": "ONE"
      }
    ],
    "synopsis": "After rigorously training for three years, the ordinary Saitama has gained immense strength which allows him to take out anyone and anything with just one punch. He decides to put his new skill to good use by becoming a hero. However, he quickly becomes bored with easily defeating monsters, and wants someone to give him a challenge to bring back the spark of being a hero.\n\r\nUpon bearing witness to Saitama's amazing power, Genos, a cyborg, is determined to become Saitama's apprentice. During this time, Saitama realizes he is neither getting the recognition that he deserves nor known by the people due to him not being a part of the Hero Association. Wanting to boost his reputation, Saitama decides to have Genos register with him, in exchange for taking him in as a pupil. Together, the two begin working their way up toward becoming true heroes, hoping to find strong enemies and earn respect in the process.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages": ["https://i.imgur.com/ZSYSgSf.jpg","https://i.imgur.com/WPzU3C7.jpg","https://i.imgur.com/m9BJpVg.jpg","https://i.imgur.com/jiMDpFj.jpg","https://i.imgur.com/cusVnvh.jpg","https://i.imgur.com/VALlSrb.jpg","https://i.imgur.com/Tk0dxKe.jpg","https://i.imgur.com/vQIkx7m.jpg","https://i.imgur.com/vdu4ENl.jpg","https://i.imgur.com/qkm1bAy.jpg"]
  },
  {
    "myanimelist_id": 121496,
    "aired_on": "Mar 2018 - May 2023",
    "myanimelist_url": "https://myanimelist.net/manga/121496/Solo_Leveling",
    "title": "Solo Leveling",
    "rank": 7,
    "picture_url": "https://i.imgur.com/Bz7Vy4V.jpg",
    "score": 8.68,
    "members": 427728,
    "type": "Manhwa (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/49667/Chugong",
        "name": "Chugong"
      },
      {
        "url": "https://myanimelist.net/people/49668/Sung-rak_Jang",
        "name": "Sung-rak Jang"
      }
    ],
    "synopsis": "Ten years ago, \"the Gate\" appeared and connected the real world with the realm of magic and monsters. To combat these vile beasts, ordinary people received superhuman powers and became known as \"Hunters.\" Twenty-year-old Sung Jin-Woo is one such Hunter, but he is known as the \"World's Weakest,\" owing to his pathetic power compared to even a measly E-Rank. Still, he hunts monsters tirelessly in low-rank Gates to pay for his mother's medical bills. \n\r\nHowever, this miserable lifestyle changes when Jin-Woo—believing himself to be the only one left to die in a mission gone terribly wrong—awakens in a hospital three days later to find a mysterious screen floating in front of him. This \"Quest Log\" demands that Jin-Woo completes an unrealistic and intense training program, or face an appropriate penalty. Initially reluctant to comply because of the quest's rigor, Jin-Woo soon finds that it may just transform him into one of the world's most fearsome Hunters. \n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/xQrBvQM.jpg","https://i.imgur.com/VWigN2L.jpg","https://i.imgur.com/m6bnmiU.jpg","https://i.imgur.com/926vei2.jpg","https://i.imgur.com/BMZYx3c.jpg","https://i.imgur.com/JuoKpue.jpg","https://i.imgur.com/EfeN8zC.jpg","https://i.imgur.com/TprmKe5.jpg","https://i.imgur.com/LYL72iF.jpg","https://i.imgur.com/Gk8kPMj.jpg"]
  },
  {
    "myanimelist_id": 75989,
    "aired_on": "Jul 2014 -",
    "myanimelist_url": "https://myanimelist.net/manga/75989/Boku_no_Hero_Academia",
    "title": "My Hero Academia",
    "rank": 8,
    "picture_url": "https://i.imgur.com/CoiANuk.jpg",
    "score": 8.1,
    "members": 421164,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/9834/Kouhei_Horikoshi",
        "name": "Kouhei Horikoshi"
      }
    ],
    "volumes": "Unknown",
    "genre": [
      {
        "url": "https://myanimelist.net/manga/genre/1/Action",
        "name": "Action"
      }
    ],
    "synopsis": "One day, a four-year-old boy came to a sudden realization: the world is not fair. Eighty percent of the world's population wield special abilities, known as \"quirks,\" which have given many the power to make their childhood dreams of becoming a superhero a reality. Unfortunately, Izuku Midoriya was one of the few born without a quirk, suffering from discrimination because of it. Yet, he refuses to give up on his dream of becoming a hero; determined to do the impossible, Izuku sets his sights on the elite hero training academy, UA High.\n\r\nHowever, everything changes after a chance meeting with the number one hero and Izuku's idol, All Might. Discovering that his dream is not a dead end, the powerless boy undergoes special training, working harder than ever before. Eventually, this leads to him inheriting All Might's power, and with his newfound abilities, gets into his school of choice, beginning his grueling journey to become the successor of the best hero on the planet.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/GaowQQ8.jpg","https://i.imgur.com/mgSc63W.jpg","https://i.imgur.com/uZQR1Vk.jpg","https://i.imgur.com/ISSvv0U.jpg","https://i.imgur.com/9OeKQkr.jpg","https://i.imgur.com/YitMJEX.jpg","https://i.imgur.com/wEP4Y9t.jpg","https://i.imgur.com/EZjq52w.jpg","https://i.imgur.com/FZY3cEK.jpg","https://i.imgur.com/P2RWuFj.jpg"]
  },
  {
    "myanimelist_id": 4632,
    "aired_on": "Mar 2007 - Nov 2013",
    "myanimelist_url": "https://myanimelist.net/manga/4632/Oyasumi_Punpun",
    "title": "Goodnight Punpun",
    "rank": 9,
    "picture_url": "https://i.imgur.com/eFmabgM.jpg",
    "score": 9.02,
    "members": 407182,
    "type": "Manga (13 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2836/Inio_Asano",
        "name": "Inio Asano"
      }
    ],
    "synopsis": "Punpun Onodera is a normal 11-year-old boy living in Japan. Hopelessly idealistic and romantic, Punpun begins to see his life take a subtle—though nonetheless startling—turn to the adult when he meets the new girl in his class, Aiko Tanaka. It is then that the quiet boy learns just how fickle maintaining a relationship can be, and the surmounting difficulties of transitioning from a naïve boyhood to a convoluted adulthood. When his father assaults his mother one night, Punpun realizes another thing: those whom he looked up to were not as impressive as he once thought.\n\r\nAs his problems increase, Punpun's once shy demeanor turns into voluntary reclusiveness. Rather than curing him of his problems and conflicting emotions, this merely intensifies them, sending him down the dark path of maturity in this grim coming-of-age saga.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/eFmabgM.jpg","https://i.imgur.com/ZufCkHQ.jpg","https://i.imgur.com/dv0Vf3A.jpg","https://i.imgur.com/mauG36l.jpg","https://i.imgur.com/LxJ459B.jpg","https://i.imgur.com/9rqt3Jg.jpg","https://i.imgur.com/stoH7iJ.jpg","https://i.imgur.com/V6AdYrW.jpg","https://i.imgur.com/o1O24BK.jpg","https://i.imgur.com/y6SpmnH.jpg"]
  },
  {
    "myanimelist_id": 96792,
    "aired_on": "Feb 2016 - May 2020",
    "myanimelist_url": "https://myanimelist.net/manga/96792/Kimetsu_no_Yaiba",
    "title": "Demon Slayer: Kimetsu no Yaiba",
    "rank": 10,
    "picture_url": "https://i.imgur.com/iwSmanP.jpg",
    "score": 8.23,
    "members": 406521,
    "type": "Manga (23 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/40398/Koyoharu_Gotouge",
        "name": "Koyoharu Gotouge"
      }
    ],
    "synopsis": "Tanjirou Kamado lives with his impoverished family on a remote mountain. As the oldest sibling, he took upon the responsibility of ensuring his family's livelihood after the death of his father. On a cold winter day, he goes down to the local village in order to sell some charcoal. As dusk falls, he is forced to spend the night in the house of a curious man who cautions him of strange creatures that roam the night: malevolent demons who crave human flesh.\n\r\nWhen he finally makes his way home, Tanjirou's worst nightmare comes true. His entire family has been brutally slaughtered with the sole exception of his sister Nezuko, who has turned into a flesh-eating demon. Engulfed in hatred and despair, Tanjirou desperately tries to stop Nezuko from attacking other people, setting out on a journey to avenge his family and find a way to turn his beloved sister back into a human.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/y4L3YVH.jpg","https://i.imgur.com/zdOuysd.jpg","https://i.imgur.com/Ksdq2P3.jpg","https://i.imgur.com/HCMtHoR.jpg","https://i.imgur.com/QgiUfXz.jpg","https://i.imgur.com/DjtCjHq.jpg","https://i.imgur.com/ARBSTsK.jpg","https://i.imgur.com/UDhXPWX.jpg","https://i.imgur.com/c2D45jh.jpg","https://i.imgur.com/1YKZp7W.jpg"]
  },
  {
    "myanimelist_id": 11,
    "aired_on": "Sep 1999 - Nov 2014",
    "myanimelist_url": "https://myanimelist.net/manga/11/Naruto",
    "title": "Naruto",
    "rank": 11,
    "picture_url": "https://i.imgur.com/dnekNij.jpg",
    "score": 8.07,
    "members": 399974,
    "type": "Manga (72 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1879/Masashi_Kishimoto",
        "name": "Masashi Kishimoto"
      }
    ],
    "synopsis": "Whenever Naruto Uzumaki proclaims that he will someday become the Hokage—a title bestowed upon the best ninja in the Village Hidden in the Leaves—no one takes him seriously. Since birth, Naruto has been shunned and ridiculed by his fellow villagers. But their contempt isn't because Naruto is loud-mouthed, mischievous, or because of his ineptitude in the ninja arts, but because there is a demon inside him. Prior to Naruto's birth, the powerful and deadly Nine-Tailed Fox attacked the village. In order to stop the rampage, the Fourth Hokage sacrificed his life to seal the demon inside the body of the newborn Naruto.\n\r\nAnd so when he is assigned to Team 7—along with his new teammates Sasuke Uchiha and Sakura Haruno, under the mentorship of veteran ninja Kakashi Hatake—Naruto is forced to work together with other people for the first time in his life. Through undergoing vigorous training and taking on challenging missions, Naruto must learn what it means to work in a team and carve his own route toward becoming a full-fledged ninja recognized by his village.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/cAuSTNF.jpg","https://i.imgur.com/xgGlLek.jpg","https://i.imgur.com/lMKVhsT.jpg","https://i.imgur.com/xKENDBG.jpg","https://i.imgur.com/k1Q5lHp.jpg","https://i.imgur.com/8Lstyso.jpg","https://i.imgur.com/R79X5wL.jpg","https://i.imgur.com/X8JnH0K.jpg","https://i.imgur.com/OjJWrEE.jpg","https://i.imgur.com/QBqNT8t.jpg"]
  },
  {
    "myanimelist_id": 21,
    "aired_on": "Dec 2003 - May 2006",
    "myanimelist_url": "https://myanimelist.net/manga/21/Death_Note",
    "title": "Death Note",
    "rank": 12,
    "picture_url": "https://i.imgur.com/1ZlKWN2.jpg",
    "score": 8.7,
    "members": 378589,
    "type": "Manga (12 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1888/Takeshi_Obata",
        "name": "Takeshi Obata"
      },
      {
        "url": "https://myanimelist.net/people/2111/Tsugumi_Ohba",
        "name": "Tsugumi Ohba"
      }
    ],
    "synopsis": "Ryuk, a god of death, drops his Death Note into the human world for personal pleasure. In Japan, prodigious high school student Light Yagami stumbles upon it. Inside the notebook, he finds a chilling message: those whose names are written in it shall die. Its nonsensical nature amuses Light; but when he tests its power by writing the name of a criminal in it, they suddenly meet their demise. \n\r\nRealizing the Death Note's vast potential, Light commences a series of nefarious murders under the pseudonym \"Kira,\" vowing to cleanse the world of corrupt individuals and create a perfect society where crime ceases to exist. However, the police quickly catch on, and they enlist the help of L—a mastermind detective—to uncover the culprit.\n\nDeath Note tells the thrilling tale of Light and L as they clash in a great battle-of-minds, one that will determine the future of the world.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages": ["https://i.imgur.com/kLWPX6t.jpg","https://i.imgur.com/8pgqsdr.jpg","https://i.imgur.com/krfOdMQ.jpg","https://i.imgur.com/ipbgg50.jpg","https://i.imgur.com/UKKb90g.jpg","https://i.imgur.com/QNA3c7O.jpg","https://i.imgur.com/0CZbVMZ.jpg","https://i.imgur.com/3kj9MuR.jpg","https://i.imgur.com/KryOrmp.jpg","https://i.imgur.com/xodtiEr.jpg"]
  },
  {
    "myanimelist_id": 12,
    "aired_on": "Aug 2001 - Aug 2016",
    "myanimelist_url": "https://myanimelist.net/manga/12/Bleach",
    "title": "Bleach",
    "rank": 13,
    "picture_url": "https://i.imgur.com/FceANkA.jpg",
    "score": 7.84,
    "members": 364443,
    "type": "Manga (74 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1880/Tite_Kubo",
        "name": "Tite Kubo"
      }
    ],
    "synopsis": "For as long as he can remember, high school student Ichigo Kurosaki has been able to see the spirits of the dead, but that has not stopped him from leading an ordinary life. One day, Ichigo returns home to find an intruder in his room who introduces herself as Rukia Kuchiki, a Soul Reaper tasked with helping souls pass over. Suddenly, the two are jolted from their conversation when a Hollow—an evil spirit known for consuming souls—attacks. As Ichigo makes a brash attempt to stop the Hollow, Rukia steps in and shields him from a counterattack. Injured and unable to keep fighting, Rukia suggests a risky plan—transfer half of her Soul Reaper powers to Ichigo. He accepts and, to Rukia's surprise, ends up absorbing her powers entirely, allowing him to easily dispatch the Hollow.\n\r\nNow a Soul Reaper himself, Ichigo must take up Rukia's duties of exterminating Hollows and protecting spirits, both living and dead. Along with his friends Orihime Inoue and Yasutora Sado—who later discover spiritual abilities of their own—Ichigo soon learns that the consequences of becoming a Soul Reaper and dealing with the world of spirits are far greater than he ever imagined.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/rVy6hmu.jpg","https://i.imgur.com/SZ1JuJW.jpg","https://i.imgur.com/JzpMI51.jpg","https://i.imgur.com/amoEnxr.jpg","https://i.imgur.com/BrJG9TS.jpg","https://i.imgur.com/fndSHt7.jpg","https://i.imgur.com/HGDlRsd.jpg","https://i.imgur.com/Y2hHcMz.jpg","https://i.imgur.com/38JgDLb.jpg","https://i.imgur.com/9BpYWTV.jpg"]
  },
  {
    "myanimelist_id": 113138,
    "aired_on": "Mar 2018 -",
    "myanimelist_url": "https://myanimelist.net/manga/113138/Jujutsu_Kaisen",
    "title": "Jujutsu Kaisen",
    "rank": 14,
    "picture_url": "https://i.imgur.com/vSqalIl.jpg",
    "score": 8.52,
    "members": 345508,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/47924/Gege_Akutami",
        "name": "Gege Akutami"
      }
    ],
    "synopsis": "Hidden in plain sight, an age-old conflict rages on. Supernatural monsters known as \"Curses\" terrorize humanity from the shadows, and powerful humans known as \"Jujutsu\" sorcerers use mystical arts to exterminate them. When high school student Yuuji Itadori finds a dried-up finger of the legendary Curse Sukuna Ryoumen, he suddenly finds himself joining this bloody conflict.\n\r\nAttacked by a Curse attracted to the finger's power, Yuuji makes a reckless decision to protect himself, gaining the power to combat Curses in the process but also unwittingly unleashing the malicious Sukuna into the world once more. Though Yuuji can control and confine Sukuna to his own body, the Jujutsu world classifies Yuuji as a dangerous, high-level Curse who must be exterminated.\n\r\nDetained and sentenced to death, Yuuji meets Satoru Gojou—a teacher at Jujutsu High School—who explains that despite his imminent execution, there is an alternative for him. Being a rare vessel to Sukuna, if Yuuji were to die, then Sukuna would perish too. Therefore, if Yuuji were to consume the many other remnants of Sukuna, then Yuuji's subsequent execution would truly eradicate the malicious demon. Taking up this chance to make the world safer and live his life for a little longer, Yuuji enrolls in Jujutsu High, jumping headfirst into a harsh and unforgiving battlefield.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/6JWitND.jpg","https://i.imgur.com/QkSoB0G.jpg","https://i.imgur.com/mRvZQhh.jpg","https://i.imgur.com/CiA00LQ.jpg","https://i.imgur.com/axWIXxU.jpg","https://i.imgur.com/RmoCRom.jpg","https://i.imgur.com/DK8nlC8.jpg","https://i.imgur.com/c24G52p.jpg","https://i.imgur.com/us2k6aU.jpg","https://i.imgur.com/sDS617L.jpg"]
  },
  {
    "myanimelist_id": 656,
    "aired_on": "Sep 1998 - May 2015",
    "myanimelist_url": "https://myanimelist.net/manga/656/Vagabond",
    "title": "Vagabond",
    "rank": 15,
    "picture_url": "https://i.imgur.com/RFQSrm3.jpg",
    "score": 9.23,
    "members": 342100,
    "type": "Manga (37 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1911/Takehiko_Inoue",
        "name": "Takehiko Inoue"
      },
      {
        "url": "https://myanimelist.net/people/5760/Eiji_Yoshikawa",
        "name": "Eiji Yoshikawa"
      }
    ],
    "synopsis": "In 16th-century Japan, Shinmen Takezou is a wild, rough young man, in both his appearance and his actions. His aggressive nature has won him the collective reproach and fear of his village, leading him and his best friend, Matahachi Honiden, to run away in search of something grander than provincial life. The pair enlist in the Toyotomi army, yearning for glory—but when the Toyotomi suffer a crushing defeat at the hands of the Tokugawa Clan at the Battle of Sekigahara, the friends barely make it out alive.\n\r\nAfter the two are separated, Shinmen returns home on a self-appointed mission to notify the Hon'iden family of Matahachi's survival. He instead finds himself a wanted criminal, framed for his friend's supposed murder based on his history of violence. Upon being captured, he is strung up on a tree and left to die. An itinerant monk, the distinguished Takuan Soho, takes pity on the \"devil child,\" secretly freeing Shinmen and christening him with a new name to avoid pursuit by the authorities: Musashi Miyamoto.\n\nVagabond is the fictitious retelling of the life of one of Japan's most renowned swordsmen, the \"Sword Saint\" Musashi Miyamoto—his rise from a swordsman with no desire other than to become \"Invincible Under the Heavens\" to an enlightened warrior who slowly learns of the importance of close friends, self-reflection, and life itself.\n\r\n[Written by MAL Rewrite]",
    "firstTenPages":["https://i.imgur.com/FDFh9JT.jpg","https://i.imgur.com/dIb1IHl.jpg","https://i.imgur.com/Z5SEMBK.jpg","https://i.imgur.com/WH7ZZSD.jpg","https://i.imgur.com/IVlUFB9.jpg","https://i.imgur.com/bRAiAsj.jpg","https://i.imgur.com/ic9559R.jpg", "https://i.imgur.com/UEkywWR.jpg", "https://i.imgur.com/kQXyBOk.jpg","https://i.imgur.com/Xj6ax8L.jpg"]
  },
  {
    "myanimelist_id": 42451,
    "aired_on": "Oct 2011 - Mar 2021",
    "myanimelist_url": "https://myanimelist.net/manga/42451/Horimiya",
    "title": "Horimiya",
    "rank": 16,
    "picture_url": "https://i.imgur.com/OPEXF9p.jpg",
    "score": 8.43,
    "members": 322149,
    "type": "Manga (16 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/12332/Daisuke_Hagiwara",
        "name": "Daisuke Hagiwara"
      },
      {
        "url": "https://myanimelist.net/people/16703/HERO",
        "name": "HERO"
      }
    ],
    "synopsis": "Although admired at school for her amiability and academic prowess, high school student Kyouko Hori has been hiding another side of her. With her parents often away from home due to work, Hori has to look after her younger brother and do the housework, leaving no chance to socialize away from school.\n\r\nMeanwhile, Izumi Miyamura is seen as a brooding, glasses-wearing otaku. However, in reality, he is a gentle person inept at studying. Furthermore, he has nine piercings hidden behind his long hair and a tattoo along his back and left shoulder.\n\r\nBy sheer chance, Hori and Miyamura cross paths outside of school—neither looking as the other expects. These seemingly polar opposites become friends, sharing with each other a side they have never shown to anyone else.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 100128,
    "aired_on": "Aug 2016 - Jun 2020",
    "myanimelist_url": "https://myanimelist.net/manga/100128/Yakusoku_no_Neverland",
    "title": "The Promised Neverland",
    "rank": 17,
    "picture_url": "https://i.imgur.com/8E2isOk.jpg",
    "score": 8.17,
    "members": 295759,
    "type": "Manga (20 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/30777/Posuka_Demizu",
        "name": "Posuka Demizu"
      },
      {
        "url": "https://myanimelist.net/people/41738/Kaiu_Shirai",
        "name": "Kaiu Shirai"
      }
    ],
    "synopsis": "At Grace Field House, life couldn't be better for the orphans! Though they have no parents, together with the other kids and a kind \"Mama\" who cares for them, they form one big, happy family. No child is ever overlooked, especially since they are all adopted by the age of 12. Their daily lives involve rigorous tests, but afterwards, they are allowed to play outside. \n\r\nThere is only one rule they must obey: do not leave the orphanage. But one day, two top-scoring orphans, Emma and Norman, venture past the gate and unearth the harrowing secret behind their entire existence. Utilizing their quick-wittedness, the children must work together to somehow change their predetermined fate.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 119161,
    "aired_on": "Mar 2019 -",
    "myanimelist_url": "https://myanimelist.net/manga/119161/Spy_x_Family",
    "title": "Spy x Family",
    "rank": 18,
    "picture_url": "https://i.imgur.com/mMqfbUc.jpg",
    "score": 8.59,
    "members": 282775,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/3543/Tatsuya_Endou",
        "name": "Tatsuya Endou"
      }
    ],
    "synopsis": "For the agent known as \"Twilight,\" no order is too tall if it is for the sake of peace. Operating as Westalis' master spy, Twilight works tirelessly to prevent extremists from sparking a war with neighboring country Ostania. For his latest mission, he must investigate Ostanian politician Donovan Desmond by infiltrating his son's school: the prestigious Eden Academy. Thus, the agent faces the most difficult task of his career: get married, have a child, and play family.\n\r\nTwilight, or \"Loid Forger,\" quickly adopts the unassuming orphan Anya to play the role of a six-year-old daughter and prospective Eden Academy student. For a wife, he comes across Yor Briar, an absent-minded office worker who needs a pretend partner of her own to impress her friends. However, Loid is not the only one with a hidden nature. Yor moonlights as the lethal assassin \"Thorn Princess.\" For her, marrying Loid creates the perfect cover. Meanwhile, Anya is not the ordinary girl she appears to be; she is an esper, the product of secret experiments that allow her to read minds. Although she uncovers their true identities, Anya is thrilled that her new parents are cool secret agents! She would never tell them, of course. That would ruin the fun.\n\r\nUnder the guise of \"The Forgers,\" the spy, the assassin, and the esper must act as a family while carrying out their own agendas. Although these liars and misfits are only playing parts, they soon find that family is about far more than blood relations.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 25,
    "aired_on": "Jul 2001 - Sep 2010",
    "myanimelist_url": "https://myanimelist.net/manga/25/Fullmetal_Alchemist",
    "title": "Fullmetal Alchemist",
    "rank": 19,
    "picture_url": "https://i.imgur.com/McA3QSR.jpg",
    "score": 9.04,
    "members": 281939,
    "type": "Manga (27 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1874/Hiromu_Arakawa",
        "name": "Hiromu Arakawa"
      }
    ],
    "synopsis": "Alchemists are knowledgeable and naturally talented individuals who can manipulate and modify matter due to their art. Yet despite the wide range of possibilities, alchemy is not as all-powerful as most would believe. Human transmutation is strictly forbidden, and whoever attempts it risks severe consequences. Even so, siblings Edward and Alphonse Elric decide to ignore this great taboo and bring their mother back to life. Unfortunately, not only do they fail in resurrecting her, they also pay an extremely high price for their arrogance: Edward loses his left leg and Alphonse his entire body. Furthermore, Edward also gives up his right arm in order to seal his brother's soul into a suit of armor.\n\r\nYears later, the young alchemists travel across the country looking for the Philosopher's Stone, in the hopes of recovering their old bodies with its power. However, their quest for the fated stone also leads them to unravel far darker secrets than they could ever imagine.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 642,
    "aired_on": "Apr 2005 -",
    "myanimelist_url": "https://myanimelist.net/manga/642/Vinland_Saga",
    "title": "Vinland Saga",
    "rank": 20,
    "picture_url": "https://i.imgur.com/BXiDKb2.jpg",
    "score": 9.04,
    "members": 276257,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2034/Makoto_Yukimura",
        "name": "Makoto Yukimura"
      }
    ],
    "synopsis": "Thorfinn, son of one of the Vikings' greatest warriors, is among the finest fighters in the merry band of mercenaries run by the cunning Askeladd, an impressive feat for a person his age. However, Thorfinn is not part of the group for the plunder it entails—instead, for having caused his family great tragedy, the boy has vowed to kill Askeladd in a fair duel. Not yet skilled enough to defeat him, but unable to abandon his vengeance, Thorfinn spends his boyhood with the mercenary crew, honing his skills on the battlefield among the war-loving Danes, where killing is just another pleasure of life.\n\r\nOne day, when Askeladd receives word that Danish prince Canute has been taken hostage, he hatches an ambitious plot—one that will decide the next King of England and drastically alter the lives of Thorfinn, Canute, and himself. Set in 11th-century Europe, Vinland Saga tells a bloody epic in an era where violence, madness, and injustice are inescapable, providing a paradise for the battle-crazed and utter hell for the rest who live in it.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 81117,
    "aired_on": "Oct 2014 - Jul 2018",
    "myanimelist_url": "https://myanimelist.net/manga/81117/Tokyo_Ghoul_re",
    "title": "Tokyo Ghoul:re",
    "rank": 21,
    "picture_url": "https://i.imgur.com/shg6ymx.jpg",
    "score": 8.27,
    "members": 269449,
    "type": "Manga (16 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/15753/Sui_Ishida",
        "name": "Sui Ishida"
      }
    ],
    "synopsis": "Two years have passed since the CCG's raid on Anteiku. Although the atmosphere in Tokyo has changed drastically due to the increased influence of the CCG, ghouls continue to pose a problem as they have begun taking caution, especially the terrorist organization Aogiri Tree, who acknowledge the CCG's growing threat to their existence.\n\r\nThe creation of a special team, known as the Quinx Squad, may provide the CCG with the push they need to exterminate Tokyo's unwanted residents. As humans who have undergone surgery in order to make use of the special abilities of ghouls, they participate in operations to eradicate the dangerous creatures. The leader of this group, Haise Sasaki, is a half-ghoul, half-human who has been trained by famed special class investigator, Kishou Arima. However, there's more to this young man than meets the eye, as unknown memories claw at his mind, slowly reminding him of the person he used to be.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 598,
    "aired_on": "Aug 2006 - Jul 2017",
    "myanimelist_url": "https://myanimelist.net/manga/598/Fairy_Tail",
    "title": "Fairy Tail",
    "rank": 22,
    "picture_url": "https://i.imgur.com/MwhI7pf.jpg",
    "score": 7.56,
    "members": 264066,
    "type": "Manga (63 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1882/Hiro_Mashima",
        "name": "Hiro Mashima"
      }
    ],
    "synopsis": "In the mystical realm of Earth Land, magic exists at the core of everyday life for its inhabitants, from transportation to utilities and everything in between. However, even with all its benefits, magic can also be used for great evil; therefore, to prevent dark forces from upsetting the natural order of things, there exists a system of magical guilds in the Kingdom of Fiore. Under the command of their respective guild masters, these guilds are made up of witches and wizards who take on various job requests to earn fame and fortune. One particular guild stands high above the rest in both strength and spirit, and its name is Fairy Tail.\n\r\nIn his quest to find his dragon foster father—Igneel—Natsu Dragneel, a fiery and reckless mage, and his partner Happy run into a young celestial mage by the name of Lucy Heartfilia, who reveals that it's her dream to become a full-fledged wizard and join the Fairy Tail guild. After rescuing her from an abduction attempt, Natsu offers her a home in Fairy Tail. Now a member of the guild, Lucy teams up with Natsu and befriends fellow wizards Gray Fullbuster and Erza \"Titania\" Scarlet. Together, this motley crew set out on their many adventures, gaining many faithful allies and deadly foes along the way.\n\r\n[Written by MAL Rewrite]"

  },
  {
    "myanimelist_id": 56805,
    "aired_on": "Aug 2013 - Nov 2014",
    "myanimelist_url": "https://myanimelist.net/manga/56805/Koe_no_Katachi",
    "title": "A Silent Voice",
    "rank": 23,
    "picture_url": "https://i.imgur.com/e1X4qZP.jpg",
    "score": 8.86,
    "members": 259071,
    "type": "Manga (7 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/10951/Yoshitoki_Ooima",
        "name": "Yoshitoki Oima"
      }
    ],
    "synopsis": "Shouya Ishida, a mischievous elementary school student, finds himself troubled by deaf transfer student Shouko Nishimiya. Despite her genuine attempts to befriend her new classmates, Shouko only proves herself to be an annoyance for Shouya and his friends, provoking them to ridicule her at any possible chance. Soon enough, their taunts turn into constant assault—yet the teachers heartlessly remain apathetic to the situation.\n\r\nShouya's misdeeds are finally stopped when Shouko transfers to another school. Denying their involvement, the entire class puts the blame on Shouya. As the new victim of bullying, Shouya gradually becomes meek and reclusive, being treated with contempt and disregard for years to come.\n\r\nNow a high school student, Shouya meets Shouko again for the first time in five years. Still tormented by his past actions, Shouya is determined to make amends for his mistakes and confront his trauma—even if he must face arduous obstacles along the way.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 26,
    "aired_on": "Mar 1998 -",
    "myanimelist_url": "https://myanimelist.net/manga/26/Hunter_x_Hunter",
    "title": "Hunter x Hunter",
    "rank": 24,
    "picture_url": "https://i.imgur.com/mq1d0rb.jpg",
    "score": 8.73,
    "members": 254867,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1893/Yoshihiro_Togashi",
        "name": "Yoshihiro Togashi"
      }
    ],
    "synopsis": "\"Secret treasure hoards, undiscovered wealth... mystical places, unexplored frontiers... 'The mysterious unknown.' There's magic in such words for those captivated by its spell. They are called 'Hunters'!\"\n\r\nGon Freecss wants to become a Hunter so he can find his father, a man who abandoned him to pursue a life of adventure. But it's not that simple: only one in one hundred thousand can pass the Hunter Exam, and that is just the first obstacle on his journey. During the Hunter Exam, Gon befriends many other potential Hunters, such as the mysterious Killua; the revenge-driven Kurapika; and Leorio, who aims to become a doctor. There's a world of adventure and peril awaiting, and those who embrace it with open arms can become the greatest Hunters of them all!\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 90125,
    "aired_on": "May 2015 - Nov 2022",
    "myanimelist_url": "https://myanimelist.net/manga/90125/Kaguya-sama_wa_Kokurasetai__Tensai-tachi_no_Renai_Zunousen",
    "title": "Kaguya-sama: Love Is War",
    "rank": 25,
    "picture_url": "https://i.imgur.com/RpewDqY.jpg",
    "score": 8.92,
    "members": 253303,
    "type": "Manga (28 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2139/Aka_Akasaka",
        "name": "Aka Akasaka"
      }
    ],
    "synopsis": "Considered a genius due to having the highest grades in the country, Miyuki Shirogane leads the prestigious Shuchiin Academy's student council as its president, working alongside the beautiful and wealthy vice president Kaguya Shinomiya. The two are often regarded as the perfect couple by students despite them not being in any sort of romantic relationship.\n\r\nHowever, the truth is that after spending so much time together, the two have developed feelings for one another; unfortunately, neither is willing to confess, as doing so would be a sign of weakness. With their pride as elite students on the line, Miyuki and Kaguya embark on a quest to do whatever is necessary to get a confession out of the other. Through their daily antics, the battle of love begins!\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 1706,
    "aired_on": "Jan 2004 - Apr 2011",
    "myanimelist_url": "https://myanimelist.net/manga/1706/JoJo_no_Kimyou_na_Bouken_Part_7__Steel_Ball_Run",
    "title": "JoJo's Bizarre Adventure Part 7: Steel Ball Run",
    "rank": 26,
    "picture_url": "https://i.imgur.com/Ny5Toeh.jpg",
    "score": 9.3,
    "members": 244563,
    "type": "Manga (24 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2619/Hirohiko_Araki",
        "name": "Hirohiko Araki"
      }
    ],
    "synopsis": "In the American Old West, the world's greatest race is about to begin. Thousands line up in San Diego to travel over six thousand kilometers for a chance to win the grand prize of fifty million dollars. With the era of the horse reaching its end, contestants are allowed to use any kind of vehicle they wish. Competitors will have to endure grueling conditions, traveling up to a hundred kilometers a day through uncharted wastelands. The Steel Ball Run is truly a one-of-a-kind event.\n\r\nThe youthful Johnny Joestar, a crippled former horse racer, has come to San Diego to watch the start of the race. There he encounters Gyro Zeppeli, a racer with two steel balls at his waist instead of a gun. Johnny witnesses Gyro using one of his steel balls to unleash a fantastical power, compelling a man to fire his gun at himself during a duel. In the midst of the action, Johnny happens to touch the steel ball and feels a power surging through his legs, allowing him to stand up for the first time in two years. Vowing to find the secret of the steel balls, Johnny decides to compete in the race, and so begins his bizarre adventure across America on the Steel Ball Run.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 99007,
    "aired_on": "May 2016 -",
    "myanimelist_url": "https://myanimelist.net/manga/99007/Komi-san_wa_Comyushou_desu",
    "title": "Komi Can't Communicate",
    "rank": 27,
    "picture_url": "https://i.imgur.com/LmW25zu.jpg",
    "score": 8.16,
    "members": 242192,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/39281/Tomohito_Oda",
        "name": "Tomohito Oda"
      }
    ],
    "synopsis": "It's Shouko Komi's first day at the prestigious Itan Private High School, and she has already risen to the status of the school's Madonna. With long black hair and a tall, graceful appearance, she captures the attention of anyone who comes across her. There's just one problem though—despite her popularity, Shouko is terrible at communicating with others.\n\r\nHitohito Tadano is your average high school boy. With his life motto of \"read the situation and make sure to stay away from trouble,\" he quickly finds that sitting next to Shouko has made him the enemy of everyone in his class! One day, knocked out by accident, Hitohito later wakes up to the sound of Shouko's \"meow.\" He lies that he heard nothing, causing Shouko to run away. But before she can escape, Hitohito surmises that Shouko is not able to talk to others easily—in fact, she has never been able to make a single friend. Hitohito resolves to help Shouko with her goal of making one hundred friends so that she can overcome her communication disorder.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 3,
    "aired_on": "Sep 1999 - Apr 2006",
    "myanimelist_url": "https://myanimelist.net/manga/3/20th_Century_Boys",
    "title": "20th Century Boys",
    "rank": 28,
    "picture_url": "https://i.imgur.com/lt5fIAF.jpg",
    "score": 8.95,
    "members": 231957,
    "type": "Manga (22 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1867/Naoki_Urasawa",
        "name": "Naoki Urasawa"
      }
    ],
    "synopsis": "As the 20th century approaches its end, people all over the world are anxious that the world is changing. And probably not for the better.\n\r\nKenji Endo is a normal convenience store manager who's just trying to get by. But when he learns that one of his old friends going by the name \"Donkey\" has suddenly committed suicide, and that a new cult led by a figure known as \"Friend\" is becoming more notorious, Kenji starts to feel that something isn't right. With a few key clues left behind by his deceased friend, Kenji realizes that this cult is much more than he ever thought it would be—not only is this mysterious organization directly targeting him and his childhood friends, but the whole world also faces a grave danger that only the friends have the key to stop.\n\r\nKenji's simple life of barely making ends meet is flipped upside down when he reunites with his childhood friends, and together they must figure out the truth of how their past is connected to the cult, as the turn of the century could mean the possible end of the world.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 1,
    "aired_on": "Dec 1994 - Dec 2001",
    "myanimelist_url": "https://myanimelist.net/manga/1/Monster",
    "title": "Monster",
    "rank": 29,
    "picture_url": "https://i.imgur.com/pNLMO85.jpg",
    "score": 9.15,
    "members": 224416,
    "type": "Manga (18 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1867/Naoki_Urasawa",
        "name": "Naoki Urasawa"
      }
    ],
    "synopsis": "Kenzou Tenma, a renowned Japanese neurosurgeon working in post-war Germany, faces a difficult choice: to operate on Johan Liebert, an orphan boy on the verge of death, or on the mayor of Düsseldorf. In the end, Tenma decides to gamble his reputation by saving Johan, effectively leaving the mayor for dead.\n\r\nAs a consequence of his actions, hospital director Heinemann strips Tenma of his position, and Heinemann's daughter Eva breaks off their engagement. Disgraced and shunned by his colleagues, Tenma loses all hope of a successful career—that is, until the mysterious killing of Heinemann gives him another chance.\n\r\nNine years later, Tenma is the head of the surgical department and close to becoming the director himself. Although all seems well for him at first, he soon becomes entangled in a chain of gruesome murders that have taken place throughout Germany. The culprit is a monster—the same one that Tenma saved on that fateful day nine years ago.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 564,
    "aired_on": "Jul 2000 - Jun 2013",
    "myanimelist_url": "https://myanimelist.net/manga/564/Gantz",
    "title": "Gantz",
    "rank": 30,
    "picture_url": "https://i.imgur.com/dje25U8.jpg",
    "score": 8.1,
    "members": 220956,
    "type": "Manga (37 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2718/Hiroya_Oku",
        "name": "Hiroya Oku"
      }
    ],
    "synopsis": "Lonely high school student Kei Kurono isolates himself out of a growing cynicism toward his fellow man and the cruelty they are capable of enacting. One day, while waiting to take the subway to school, Kei's classmate Masaru Katou leaps onto the tracks in an effort to save a drunk man. Driven by an uncharacteristic desire to rescue someone else, Kei follows Katou down into danger. While successful in saving him, the two boys are killed by the train.\n\r\nKei wakes up beside Katou in an apartment full of strangers and furnished by a giant black orb with a glass-like outer surface. After finding out that everyone in the room has recently died, words appear on the black ball tasking them with killing a strange creature. The ball equips Kei and the others with power suits and mysterious guns before sending them off to collect this bizarre bounty.\n\r\nAlthough Kei discovers the mission to be far more deadly than originally suspected, he manages to survive. He is teleported back to the apartment where he and the other survivors are rewarded point values according to their actions in battle by the black sphere, which a fellow survivor says is called \"Gantz.\" Despite his death earlier that day, Kei is granted the ability to return to his daily life with one condition: he can be uprooted from his day at any time and summoned back to the apartment, where Gantz will task him and other recently deceased with the assassination of another target. \n\r\nWhile Katou dreads the inevitable return to Gantz, Kei finds himself living for the sole purpose of carrying out these missions. Thriving in the heat of battle and learning to care about himself and his comrades, Kei faces escalating monstrous threats that begin to bleed out into his normal life outside of Gantz.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 104565,
    "aired_on": "Mar 2017 - Nov 2022",
    "myanimelist_url": "https://myanimelist.net/manga/104565/Tokyo卍Revengers",
    "title": "Tokyo Revengers",
    "rank": 31,
    "picture_url": "https://i.imgur.com/OlgjQIe.jpg",
    "score": 7.94,
    "members": 215128,
    "type": "Manga (31 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/10463/Ken_Wakui",
        "name": "Ken Wakui"
      }
    ],
    "synopsis": "Takemichi Hanagaki's life is at an all-time low. Just when he thought it couldn't get worse, he finds out that Hinata Tachibana, his ex-girlfriend, was murdered by the Tokyo Manji Gang: a group of vicious criminals that has been disturbing society's peace for quite some time. \n\r\nWondering where it all went wrong, Takemichi suddenly finds himself traveling through time, ending up 12 years in the past—when he was still in a relationship with Hinata. Realizing he has a chance to save her, Takemichi resolves to infiltrate the Tokyo Manji Gang and climb the ranks in order to rewrite the future and save Hinata from her tragic fate.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 436,
    "aired_on": "Jan 1998 - Aug 1999",
    "myanimelist_url": "https://myanimelist.net/manga/436/Uzumaki",
    "title": "Uzumaki",
    "rank": 32,
    "picture_url": "https://i.imgur.com/3kxzvvk.jpg",
    "score": 8.17,
    "members": 208258,
    "type": "Manga (3 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2410/Junji_Itou",
        "name": "Junji Itou"
      }
    ],
    "synopsis": "In the town of Kurouzu-cho, Kirie Goshima lives a fairly normal life with her family. As she walks to the train station one day to meet her boyfriend, Shuuichi Saito, she sees his father staring at a snail shell in an alley. Thinking nothing of it, she mentions the incident to Shuuichi, who says that his father has been acting weird lately. Shuuichi reveals his rising desire to leave the town with Kirie, saying that the town is infected with spirals.\n\r\nBut his father's obsession with the shape soon proves deadly, beginning a chain of horrific and unexplainable events that causes the residents of Kurouzu-cho to spiral into madness.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 35243,
    "aired_on": "Feb 2012 - Jul 2020",
    "myanimelist_url": "https://myanimelist.net/manga/35243/Haikyuu",
    "title": "Haikyuu!!",
    "rank": 33,
    "picture_url": "https://i.imgur.com/8CHhDO2.jpg",
    "score": 8.84,
    "members": 205177,
    "type": "Manga (45 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/8260/Haruichi_Furudate",
        "name": "Haruichi Furudate"
      }
    ],
    "synopsis": "The whistle blows. The ball is up. A dig. A set. A spike.\n\r\nVolleyball. A sport where two teams face off, separated by a formidable, wall-like net.\n\r\nThe \"Little Giant,\" standing at only 170 cm, overcomes the towering net and the wall of blockers. The awe-inspired Shouyou Hinata looks on at the ace's crow-like figure. Determined to reach great heights like the Little Giant, small-statured Hinata finally manages to form a team in his last year of junior high school, and enters his first volleyball tournament. However, his team is utterly defeated in their first game against the powerhouse school Kitagawa Daiichi, led by the genius, but oppressive setter dubbed the \"King of the Court,\" Tobio Kageyama.\n\r\nHinata enrolls into Karasuno High School seeking  to take revenge against Kageyama in an official high school match and to follow in the Little Giant's footsteps—but his plans are ruined when he opens the gymnasium door to find Kageyama as one of his teammates.\n\r\nNow, Hinata must establish himself on the team and work alongside the problematic Kageyama to overcome his shortcomings and to fulfill his dream of making it to the top of the high school volleyball world.\n\r\n[Written by MAL Rewrite]\n\nIncluded one-shot:\r\nVolume 14: Nisekyuu!!"
  },
  {
    "myanimelist_id": 86337,
    "aired_on": "Feb 2015 -",
    "myanimelist_url": "https://myanimelist.net/manga/86337/Black_Clover",
    "title": "Black Clover",
    "rank": 34,
    "picture_url": "https://i.imgur.com/DVkHO0e.jpg",
    "score": 7.86,
    "members": 202943,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/15063/Yuuki_Tabata",
        "name": "Yuuki Tabata"
      }
    ],
    "synopsis": "In a world full of magic, Asta—an orphan who is overly loud and energetic—possesses none whatsoever. Despite this, he dreams of becoming the Wizard King, a title bestowed upon the strongest mage in the Clover Kingdom. Possessing the same aspiration, Asta's childhood friend and rival Yuno has been blessed with the ability to control powerful wind magic. Even with this overwhelming gap between them, hoping to somehow awaken his magical abilities and catch up to Yuno, Asta trains his body relentlessly every day.\n\r\nIn the Clover Kingdom, once a person turns 15 years old, it is time for them to receive their Grimoire, an item allowing its wielder to use their magic to its full capacity. At the ceremony, Yuno obtains a Grimoire with a legendary four-leaf clover, indicating the exceptional strength of its wielder, while Asta pointlessly waits for his. Feeling dejected, yet unwilling to give up, Asta sees Yuno caught by a mage who is trying to steal Yuno's special Grimoire. Despite being completely overpowered by Yuno's captor, Asta's will to keep fighting rewards him with his very own Grimoire—one with an unheard-of black five-leaf clover.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 3986,
    "aired_on": "Apr 2007 - Jul 2013",
    "myanimelist_url": "https://myanimelist.net/manga/3986/Deadman_Wonderland",
    "title": "Deadman Wonderland",
    "rank": 35,
    "picture_url": "https://i.imgur.com/MvFR5Lu.jpg",
    "score": 7.96,
    "members": 195477,
    "type": "Manga (13 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2887/Kazuma_Kondou",
        "name": "Kazuma Kondou"
      },
      {
        "url": "https://myanimelist.net/people/2888/Jinsei_Kataoka",
        "name": "Jinsei Kataoka"
      }
    ],
    "synopsis": "After a powerful earthquake nearly destroyed all of Tokyo, a prison known as Deadman Wonderland rose from what was left of the city. Privately-run through the guise and functions of a theme park, Deadman Wonderland takes in prisoners from all over Japan, using them as attractions for tourists. Little do the public know about the true purpose of this \"theme park\" and the horrors that take place within.\n\r\nEnter Ganta Igarashi, a middle school student who has lived a normal life since the great earthquake occurred. This all changes when a mysterious masked murderer called the Red Man appears and kills his entire class, knocking him unconscious which consequently left him as the sole survivor. When he awakens, he is falsely convicted as the perpetrator behind the massacre, landing him a spot in Deadman Wonderland. What will become of this new inmate whose life depends on the bizarre \"games\" that this prison holds? And just what does Shiro, Ganta's supposed childhood friend who awaits his arrival, know about the Red Man?\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 3009,
    "aired_on": "Dec 1999 - Apr 2003",
    "myanimelist_url": "https://myanimelist.net/manga/3009/JoJo_no_Kimyou_na_Bouken_Part_6__Stone_Ocean",
    "title": "JoJo's Bizarre Adventure Part 6: Stone Ocean",
    "rank": 36,
    "picture_url": "https://i.imgur.com/jIV1ljI.jpg",
    "score": 8.26,
    "members": 194139,
    "type": "Manga (17 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2619/Hirohiko_Araki",
        "name": "Hirohiko Araki"
      }
    ],
    "synopsis": "In Florida, 2011, Jolyne Kuujou sits in a jail cell like her father Joutarou once did; yet this situation is not of her own choice. Framed for a crime she didn't commit, and manipulated into serving a longer sentence, Jolyne is ready to resign to a dire fate as a prisoner of Green Dolphin Street Jail. Though all hope seems lost, a gift from Joutarou ends up awakening her latent abilities, manifesting into her Stand, Stone Free. Now armed with the power to change her fate, Jolyne sets out to find an escape from the stone ocean that holds her.\n\r\nHowever, Jolyne soon discovers that her incarceration is merely a small part of a grand plot: one that not only takes aim at her family, but has additional far-reaching consequences. What's more, the mastermind is lurking within the very same prison, and is under the protection of a lineup of menacing Stand users. Finding unlikely allies to help her cause, Jolyne sets course to stop their plot, clear her name, and take back her life.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 31499,
    "aired_on": "Nov 2011 - Aug 2016",
    "myanimelist_url": "https://myanimelist.net/manga/31499/Nisekoi",
    "title": "Nisekoi",
    "rank": 37,
    "picture_url": "https://i.imgur.com/38ICq3z.jpg",
    "score": 7.72,
    "members": 192427,
    "type": "Manga (25 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/4766/Naoshi_Komi",
        "name": "Naoshi Komi"
      }
    ],
    "synopsis": "When Raku Ichijou was young, he made a heartfelt promise to his childhood friend that if they were to meet again, they would marry each other. Ten years have passed since that fateful day, leaving Raku's memory of her faded. But he still holds a relic of their relationship together—a locked pendant, which his childhood friend holds the key to. He hopes to reunite with her one day, despite not remembering what she looks like.\n\r\nNow a first-year student at Bonyari High School, Raku attempts to live a normal life, dreaming of becoming a public servant and marrying his crush Kosaki Onodera. However, this isn't as easy as it seems, as he is the unwilling heir to a large yakuza family, and Raku can't escape from his duties when the American Bee Hive gang wages war on his family's turf. In order to forge peace between the two feuding families, Raku is forced into a fake romantic relationship with Chitoge Kirisaki, the beautiful daughter of the Bee Hive's leader. The two quickly come to hate each other, but have to learn to live together and pretend to be deeply in love in order to keep their families at bay. \n\r\nHowever, Raku's quest for the key to his pendant isn't becoming easier as more girls—who were all involved with his pendant in some way—enter his life. Join Raku as he juggles his false relationship, maintains the balance between warring families, and unravels the identity of the girl who will unlock his heart.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 583,
    "aired_on": "May 2001 - Oct 2014",
    "myanimelist_url": "https://myanimelist.net/manga/583/Claymore",
    "title": "Claymore",
    "rank": 38,
    "picture_url": "https://i.imgur.com/k7prZyQ.jpg",
    "score": 8.3,
    "members": 187467,
    "type": "Manga (27 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/2517/Norihiro_Yagi",
        "name": "Norihiro Yagi"
      }
    ],
    "synopsis": "It is the Middle Ages, and the remnants of mankind are plagued by paranoia and death. Spoken in fearful whispers, the word \"Yoma\" cuts a clear image into the minds of all: monstrous beings with an insatiable hunger for human flesh. But fear of their gruesome appetite is dwarfed by that of their ability to shapeshift and steal the memories of their last meal. Forever vulnerable to attack, humans live in unease, even among family.\n\r\nThere are few means to kill a Yoma. The Organization, informally known as \"Claymore,\" is humanity's only line of defense, dispatching half-human, half-Yoma female warriors to purify villages of Yoma. A lonely and dangerous existence, death for these warriors comes with each new assignment. What time is found between trying battles and long, arduous travels is spent in ever-intensifying struggle to resist their Yoma blood and maintain their humanity. Villagers, knowing of this, pay for their security reluctantly and have only loathsome regard for their protectors.\n\nClaymore follows the stoic and low-ranking member Clare in her daunting trek as she searches for personal vengeance. Along the way, she encounters many unexpected things about the world, from the camaraderie and hope held fast by her sisters-in-arms to the sinister truth behind the Claymore Organization.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 908,
    "aired_on": "Jun 2003 - Aug 2013",
    "myanimelist_url": "https://myanimelist.net/manga/908/Soul_Eater",
    "title": "Soul Eater",
    "rank": 39,
    "picture_url": "https://i.imgur.com/Hq4dUqC.jpg",
    "score": 8.09,
    "members": 180039,
    "type": "Manga (25 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/5059/Atsushi_Ookubo",
        "name": "Atsushi Ookubo"
      }
    ],
    "synopsis": "Death City is home to the Death Weapon Meister Academy, established by Shinigami—the grim reaper himself. Created to maintain peace, the academy trains Meisters and Demon Weapons—people who take on the form of a weapon—to defend humanity against evil. The ultimate goal of a Meister is to create a \"Death Scythe\" worthy of being wielded by Shinigami. To do this, their weapon partner must consume the souls of 99 wicked humans and one witch.\n\r\nMaka Albarn and her partner Soul Eater \"Soul\" Evans are two students who hope to make a Death Scythe. They are joined by the boisterous Black☆Star and his partner Tsubaki Nakatsukasa, as well as the perfectionist Death the Kid—simply known as Kid—and his partners, the twins Patricia \"Patty\" and Elizabeth \"Liz\" Thompson. These ambitious students all work towards becoming the ultimate Meister and Demon Weapon team, through misadventures, missions, and many class trials.\n\r\nHowever, many mysteries surround them, and as new enemies are discovered and secrets are revealed, Maka, Soul, and their friends must fight to protect the academy, Death City, and the world itself from enemies far worse than humans.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 24294,
    "aired_on": "Jan 2011 - Feb 2015",
    "myanimelist_url": "https://myanimelist.net/manga/24294/Ao_Haru_Ride",
    "title": "Ao Haru Ride",
    "rank": 40,
    "picture_url": "https://i.imgur.com/kUHaMHV.jpg",
    "score": 8.15,
    "members": 179468,
    "type": "Manga (13 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/4142/Io_Sakisaka",
        "name": "Io Sakisaka"
      }
    ],
    "synopsis": "While most girls desire popularity among boys, Futaba Yoshioka wants the exact opposite. After attracting many admirers back in middle school which resulted in her being shunned by her female classmates, she decided that high school will be her chance to revamp her image. Therefore, she starts acting unfeminine and indifferent to boys, allowing her to make some \"friends\" along the way. \n\r\nLittle does Futaba know, her life will take another drastic turn when her first love, Kou Mabuchi, returns after his sudden disappearance years ago in middle school. Despite his extended absence, the fond memories they shared together still linger in her mind, and she wishes to return to those days. But she realizes that the sweet, gentle boy of the past has completely vanished, and in his place stands someone cold and pessimistic. While he admits that her feelings for him back then were mutual, he warns that they can never go back to the past, as everything, including him, has changed. \n\nAo Haru Ride follows Futaba as she searches for true love and friendship, all while trying her best to stay true to herself. \n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 103897,
    "aired_on": "Mar 2017 - Mar 2022",
    "myanimelist_url": "https://myanimelist.net/manga/103897/Dr_Stone",
    "title": "Dr. Stone",
    "rank": 41,
    "picture_url": "https://i.imgur.com/bIjGYrN.jpg",
    "score": 8.2,
    "members": 178634,
    "type": "Manga (26 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1902/Riichiro_Inagaki",
        "name": "Riichiro Inagaki"
      },
      {
        "url": "https://myanimelist.net/people/3537/Boichi",
        "name": "Boichi"
      }
    ],
    "synopsis": "When a mysterious light suddenly engulfs Earth, humanity is left petrified, frozen in stone. Thousands of years later, the world is teeming with vegetation, and forests have taken the places of cities that once stood proudly. One of the very first to emerge from their stone prison is Taiju Ooki, who finds that his good friend, a brilliant young scientist named Senkuu, has been preparing for his awakening. While Taiju wishes to save the girl he loves, Senkuu is determined to figure out the cause behind the strange phenomenon and restore the world to its former glory.\n\r\nBut when they free the infamously powerful Tsukasa Shishiou in order to gain an upper hand against the dangers in an unfamiliar world, they realize that their new comrade has other plans. Tsukasa sees their predicament as a chance to start over; free from the corruption and destruction wrought by technology, he will stop at nothing to achieve his goals. With both sides unable to see eye to eye, Senkuu and his devotion to science will clash with Tsukasa and his primal nature in what will truly be a battle of the ages.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 44485,
    "aired_on": "Oct 2012 - Mar 2020",
    "myanimelist_url": "https://myanimelist.net/manga/44485/Nanatsu_no_Taizai",
    "title": "The Seven Deadly Sins",
    "rank": 42,
    "picture_url": "https://i.imgur.com/owKjgGw.jpg",
    "score": 7.5,
    "members": 175052,
    "type": "Manga (41 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/3251/Nakaba_Suzuki",
        "name": "Nakaba Suzuki"
      }
    ],
    "synopsis": "In a world where injustice prevails, the Holy Knights of Britannia protect their homeland with their unparalleled magic and strength. Their most sought-after targets are \"The Seven Deadly Sins\": a group of criminals once regarded as the strongest of Britannia's Holy Knights. Their supposed conspiracy to overthrow the Kingdom of Liones led to their defeat at the hands of the Holy Knights, but rumors persist that the seven infamous knights still live. \n\r\nTen years later, the Holy Knights ironically stage a coup d'état themselves and capture the King of Liones, installing themselves as the new rulers of the kingdom. Elizabeth Liones, the third princess of the kingdom, sets out on a journey to find the Seven Deadly Sins and request their aid when she stumbles upon a bar owned by Meliodas, the Dragon's Sin of Wrath and the former leader of the disgraced knights. The pair sets out to find Meliodas' old comrades, but will it be hope or despair that awaits them in their travels?\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 45757,
    "aired_on": "Nov 2012 - Aug 2019",
    "myanimelist_url": "https://myanimelist.net/manga/45757/Shokugeki_no_Souma",
    "title": "Foods Wars!",
    "rank": 43,
    "picture_url": "https://i.imgur.com/jGaAfBD.jpg",
    "score": 7.93,
    "members": 175019,
    "type": "Manga (36 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/11085/Shun_Saeki",
        "name": "Shun Saeki"
      },
      {
        "url": "https://myanimelist.net/people/19791/Yuuto_Tsukuda",
        "name": "Yuuto Tsukuda"
      },
      {
        "url": "https://myanimelist.net/people/29361/Yuki_Morisaki",
        "name": "Yuki Morisaki"
      }
    ],
    "synopsis": "Fifteen-year-old Souma Yukihira dreams to one day surpass his father's cooking skills and take over as the chef of their small family diner. However, his aspirations come to a halt when his father announces the closure of their restaurant, as he must travel abroad for cooking-related business. \n\r\nIn the meantime, Souma is urged by his father to attend Tootsuki Culinary Academy: a world-renowned school where expulsions of incompetent students are commonplace. Due to the curriculum's rigor, any student that manages to graduate is recognized as a chef of great caliber. Reluctantly agreeing to the proposition, Souma heads to Tootsuki's high school division for the entrance exam. Little does he know, he will soon begin a new chapter of his life—one that entails new friends, daring rivalries, and sleepless nights.\n\r\n[Written by MAL Rewrite]\n\nIncluded one-shot:\r\nVolume 3: Kimi to Watashi no Renai Soudan"
  },
  {
    "myanimelist_id": 122663,
    "aired_on": "Jul 2010 -",
    "myanimelist_url": "https://myanimelist.net/manga/122663/Tower_of_God",
    "title": "Tower of God",
    "rank": 44,
    "picture_url": "https://i.imgur.com/jQhCXFD.jpg",
    "score": 8.4,
    "members": 174812,
    "type": "Manhwa (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/49934/SIU",
        "name": "SIU"
      }
    ],
    "synopsis": "Twenty-Fifth Bam had been alone his whole life until he met Rachel. Now, however, Rachel is set on climbing the Tower, and she is willing to leave Bam behind to do so. After Rachel disappears in a veil of light, Bam follows her, vowing to ascend the Tower in hopes of meeting her again.\n\r\nBut the Tower is a dangerous place full of ancient secrets, fearsome monsters, and nefarious humans. Each floor is protected by an Administrator who puts the daring challengers through grueling tests that will push them to their limits.\n\r\nAs he confronts Headon, the Administrator of the first floor, Bam learns that he is an ''Irregular,'' someone who was not chosen by the Tower but was able to enter it on his own, an extremely rare event inside the Tower. Regardless of this revelation, however, his path forward is clear. Be it wealth, power, glory, or even reuniting with Rachel, all desires will be realized at the top of the Tower.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 24692,
    "aired_on": "Dec 2010 -",
    "myanimelist_url": "https://myanimelist.net/manga/24692/Noragami",
    "title": "Noragami",
    "rank": 45,
    "picture_url": "https://i.imgur.com/YV9rnRW.jpg",
    "score": 8.4,
    "members": 173937,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/6644/Adachitoka",
        "name": "Adachitoka"
      }
    ],
    "synopsis": "As a relatively unknown minor deity without any worshippers, Delivery God Yato takes on odd jobs for only five yen, with the goal of amassing a fortune large enough to buy himself a shrine. But in addition to obscurity, he has another problem: his \"Shinki,\" or weapon partner, has decided to resign, tired of being with a homeless god. Left with no weapon, Yato takes on more jobs, hoping to find a new partner soon.\n\r\nWhile out putting up fliers for a missing cat, Yato sees said cat and chases after him, right into the path of an oncoming vehicle. Hiyori Iki, a nearby girl, rushes to push Yato out of the way and ends up hurt herself. After waking up in the hospital, she discovers the incident has knocked her soul loose from her body. Realizing his actions caused this, Yato promises to help return Hiyori to normal—for five yen of course. But in order to return her to normal, he requires a new Shinki, which he finds in the rebellious spirit Yukine.\n\nNoragami tells the story of a girl walking the line between two worlds, and a stray deity's quest for a place to call his own.\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 25132,
    "aired_on": "Apr 2010 - Dec 2016",
    "myanimelist_url": "https://myanimelist.net/manga/25132/Akame_ga_Kill",
    "title": "Akame ga Kill!",
    "rank": 46,
    "picture_url": "https://i.imgur.com/GTd0HvU.jpg",
    "score": 7.83,
    "members": 170979,
    "type": "Manga (15 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/9027/Tetsuya_Tashiro",
        "name": "Tetsuya Tashiro"
      },
      {
        "url": "https://myanimelist.net/people/11423/Takahiro",
        "name": "Takahiro"
      }
    ],
    "synopsis": "The ruthless Minister Honest exploits the ignorance of a new young Emperor and deviously rules the country from the shadows with twisted morals and no regard for human life. As a result of this, an epidemic of crime and corruption has spread throughout the country's capital city, and a state of society ensues where the privileged have absolute domination over the lesser.\n\r\nHowever, there exists an organization to combat this rife abuse of power: Night Raid, a secret division of the oppositionary Revolutionary Army. It is composed of a small team of ruthless assassins who murder all those who partake in or turn a blind eye to the Empire's outrageous wrongdoings. \n\r\nTatsumi is a naïve, sword-wielding young man on a journey to save his impoverished village. Soon, he witnesses the bloody horrors and cruelty of the capital firsthand. Overcome with hatred, Tatsumi is swayed by Night Raid's profound cause and decides to join them, embarking on a painful and dangerous mission to exact revenge on Minister Honest. Tatsumi gains many invaluable experiences as he unravels the ethics of conflicting ideologies, life and death, all while working toward the restoration of a humane world.\n\r\n[Written by MAL Rewrite]"

  },
  {
    "myanimelist_id": 9711,
    "aired_on": "Aug 2008 - Apr 2012",
    "myanimelist_url": "https://myanimelist.net/manga/9711/Bakuman",
    "title": "Bakuman",
    "rank": 47,
    "picture_url": "https://i.imgur.com/wkU5WqP.jpg",
    "score": 8.39,
    "members": 168392,
    "type": "Manga (20 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/1888/Takeshi_Obata",
        "name": "Takeshi Obata"
      },
      {
        "url": "https://myanimelist.net/people/2111/Tsugumi_Ohba",
        "name": "Tsugumi Ohba"
      }
    ],
    "synopsis": "Despite being a talented artist, middle school student Moritaka Mashiro is unsure about his future, accepting that he will simply lead a normal life. After seeing one of Mashiro's drawings in class, Akito Takagi—an aspiring writer—insists that they write a manga together. But Mashiro is hesitant—his uncle, a mangaka, had died from overworking just a few years prior. However, when Mashiro hears that his crush, Miho Azuki, aims to be a voice actress, he becomes determined to create a manga that can be adapted into an anime for her to star in. Reciprocating Mashiro's feelings, she agrees to get married once they have both achieved their dreams.\n\nBakuman. chronicles Mashiro and Takagi's successes and struggles in their attempts to be serialized in Weekly Shounen Jump and become famous mangakas. Will their gamble pay off, or will they join the countless number of failures?\n\r\n[Written by MAL Rewrite]"

  },
  {
    "myanimelist_id": 3031,
    "aired_on": "May 2006 - Mar 2015",
    "myanimelist_url": "https://myanimelist.net/manga/3031/Pandora_Hearts",
    "title": "Pandora Hearts",
    "rank": 48,
    "picture_url": "https://i.imgur.com/w7cgBQm.jpg",
    "score": 8.57,
    "members": 166234,
    "type": "Manga (24 vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/3483/Jun_Mochizuki",
        "name": "Jun Mochizuki"
      }
    ],
    "synopsis": "Reminiscent of a broken toy box, the mystical Abyss is a terrifying realm home to monstrous creatures called Chains. Most believe it to be only a fairy tale, used to scare children who misbehave. Oz Vessalius, the cheerful and mischievous heir of the noble Vessalius family, is one such individual—until, at his coming-of-age ceremony, the mysterious Baskerville Clan arrives and condemns him to the Abyss for a sin he neither committed nor knows anything about. Oz then forms a contract with Alice, a unique Chain who can take on human form, in an attempt to escape from the Abyss.\n\r\nAs Oz struggles to unravel the mysteries behind his sin, the Abyss, and a tragedy from one hundred years ago, he and his companions find themselves confronted by the Baskervilles and ghosts from the past. Meanwhile, his journey back home is plagued by relentless despair.\n\r\n[Written by MAL Rewrite]\n\nIncluded one-shot:\r\nVolume 8: Pandora Hearts (pilot)"
  },
  {
    "myanimelist_id": 70345,
    "aired_on": "Apr 2014 -",
    "myanimelist_url": "https://myanimelist.net/manga/70345/Grand_Blue",
    "title": "Grand Blue Dreaming",
    "rank": 49,
    "picture_url": "https://i.imgur.com/8gtpGJK.jpg",
    "score": 9.03,
    "members": 165642,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/7108/Kenji_Inoue",
        "name": "Kenji Inoue"
      },
      {
        "url": "https://myanimelist.net/people/16441/Kimitake_Yoshioka",
        "name": "Kimitake Yoshioka"
      }
    ],
    "synopsis": "Among the seaside town of Izu's ocean waves and rays of shining sun, Iori Kitahara is just beginning his freshman year at Izu University. As he moves into his uncle's scuba diving shop, Grand Blue, he eagerly anticipates his dream college life, filled with beautiful girls and good friends.\n\r\nBut things don't exactly go according to plan. Upon entering the shop, he encounters a group of rowdy, naked upperclassmen, who immediately coerce him into participating in their alcoholic activities. Though unwilling at first, Iori quickly gives in and becomes the heart and soul of the party. Unfortunately, this earns him the scorn of his cousin, Chisa Kotegawa, who walks in at precisely the wrong time. Undeterred, Iori still vows to realize his ideal college life, but will things go according to plan this time, or will his situation take yet another dive?\n\r\n[Written by MAL Rewrite]"
  },
  {
    "myanimelist_id": 110737,
    "aired_on": "Nov 2017 -",
    "myanimelist_url": "https://myanimelist.net/manga/110737/Ijiranaide_Nagatoro-san",
    "title": "Don't Toy With Me, Miss Nagatoro",
    "rank": 50,
    "picture_url": "https://i.imgur.com/B95eh0A.jpg",
    "score": 7.65,
    "members": 161872,
    "type": "Manga (? vols)",
    "authors": [
      {
        "url": "https://myanimelist.net/people/27461/774",
        "name": "774"
      }
    ],
    "synopsis": "High schooler Hayase Nagatoro loves to spend her free time doing one thing, and that is to bully her Senpai! After Nagatoro and her friends stumble upon the aspiring artist's drawings, they find enjoyment in mercilessly bullying the timid Senpai. Nagatoro resolves to continue her cruel game and visits him daily so that she can force Senpai into doing whatever interests her at the time, especially if it makes him uncomfortable.\n\r\nSlightly aroused by and somewhat fearful of Nagatoro, Senpai is constantly roped into her antics as his interests, hobbies, appearance, and even personality are used against him as she entertains herself at his expense. As time goes on, Senpai realizes that he doesn't dislike Nagatoro's presence, and the two of them develop an uneasy friendship as one patiently puts up with the antics of the other.\n\r\n[Written by MAL Rewrite]"
  }
]